gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC.c
#endif /* (ADC_ANY_CONFIG_USES_FILTER  != 0u)  */

/*******************************************************************************
* Function Name: ADC_Start
****************************************************************************//**
*
* \brief Performs all required initialization for this component and enables the
*  power. The power will be set to the appropriate power based on the clock
*  frequency.
*
* \param None
*
* \return None
*
* \sideeffect None
*
* \globalvars
*  \ref ADC_initVar (RW)
*
*******************************************************************************/
void ADC_Start(void)
{
    if (ADC_INIT_VAR_INIT_FLAG != (ADC_INIT_VAR_INIT_FLAG & ADC_initVar))
    {
        ADC_Init();
        ADC_initVar |= ADC_INIT_VAR_INIT_FLAG;
    }

    ADC_Enable();

    return;
}

/*******************************************************************************
* Function Name: ADC_StartEx
****************************************************************************//**
*
* \brief This function starts the ADC and sets the Interrupt
* Service Routine to the provided address using the
* ADC_IRQ_StartEx() function. Refer to the Interrupt component
* datasheet for more information on the ADC_IRQ_StartEx() function.
*
* \param address This is the address of a user defined function for the ISR.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_StartEx(cyisraddress address)
{
    ADC_Start();
    ADC_IRQ_StartEx(address);
    return;
}

/*******************************************************************************
* Function Name: ADC_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_Stop() API to halt conversions. Instead use the
* ADC_StopConvert() API. If you use the ADC_Stop() API
* to halt conversions then later use the ADC_Start() and
* ADC_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_StopConvert() API will enable
* the ADC to complete the current scan of channels. After the
* channel scan is complete, the ADC will stop all conversions, which
* can be detected by the use of an ISR or the ADC_IsEndConversion()
* flag.
*
*******************************************************************************/
void ADC_Stop(void)
{
    #if(0u != ADC_ANY_CONFIG_USES_FILTER)
        if((ADC_allConfigs[ADC_currentConfig].miscConfig
           & ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
           == ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            ADC_UABH_A_Stop();
            ADC_UABH_B_Stop();
            ADC_FILTERAGND2SAR_BUFFER_Stop();
        }
    #endif /* ADC_ANY_CONFIG_USES_FILTER != 0u */
    ADC_SAR_CTRL_REG &= (uint32)~ADC_SAR_CTRL_ENABLED_MSK;
    return;
}

/* ****************************************************************************
* Function Name: ADC_InitConfig
****************************************************************************//*
*
* \brief Configures all of the registers for a given configuration for scanning.
*
* \param
* config: Pointer to the configuration structure
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_InitConfig(const ADC_CONFIG_STRUCT *config)
{
    uint32 chNum;
    uint32 tmpRegVal;

    /* If there is an internal SAR clock, set up its divider values. */
    #if (ADC_CLOCK_INTERNAL)
        ADC_intSarClock_Stop();
        ADC_intSarClock_SetFractionalDividerRegister(config->clkDivider, 0u);
        ADC_intSarClock_Start();
    #endif /* ADC_CLOCK_INTERNAL */

    /* If the current configuration has a filter, set up the UAB clock divider values. */
    #if(0u != ADC_ANY_CONFIG_USES_FILTER)
        if((config->miscConfig & ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
            == ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            ADC_intUabClock_Stop();
            ADC_intUabClock_SetFractionalDividerRegister(config->filterClkDivider, 0u);
            #if defined(ADC_cy_psoc4_sar_1__CLOCK_DIV_ID)
                /* If the SAR clock divider ID is known,
                 * start the internal UAB divider aligned to the SAR divider. */
                ADC_intUabClock_StartEx(ADC_cy_psoc4_sar_1__CLOCK_DIV_ID);
            #else
                /* Otherwise start it unaligned. */
                ADC_intUabClock_Start();
            #endif
        }
    #endif /* ADC_ANY_CONFIG_USES_FILTER != 0u */

    /* Init SAR and MUX registers */
    /* Enable the SAR internal pump when global pump is enabled */
    ADC_SAR_CTRL_REG = config->ctrl
        | (((ADC_PUMP_CTRL_REG & ADC_PUMP_CTRL_ENABLED) != 0u)
            ? ADC_SAR_CTRL_BOOSTPUMP_EN_MSK : 0u);

    ADC_SAR_SAMPLE_CTRL_REG = config->sampleCtrl;
    ADC_SAR_RANGE_THRES_REG = config->rangeThres;
    ADC_SAR_RANGE_COND_REG = config->rangeCond;
    ADC_SAR_SAMPLE_TIME01_REG = config->sampleTime01;
    ADC_SAR_SAMPLE_TIME23_REG = config->sampleTime23;

    /* Connect Vminus to VSSA when even one channel is single-ended or multiple channels configured */
    if(1u == ADC_MUX_SWITCH0_INIT)
    {
        ADC_MUX_SWITCH0_REG |= ADC_MUX_FW_VSSA_VMINUS;
        /* Set MUX_HW_CTRL_VSSA in MUX_SWITCH_HW_CTRL when multiple channels enabled */
        if(1ul < config->numChannels)
        {
            ADC_MUX_SWITCH_HW_CTRL_REG |= ADC_MUX_FW_VSSA_VMINUS;
        }
    }

    /* Clear and set interrupt masks */
    ADC_SAR_SATURATE_INTR_MASK_REG = 0u;
    ADC_SAR_RANGE_INTR_MASK_REG = 0u;
    ADC_SAR_SATURATE_INTR_MASK_REG = config->satIntMask;
    ADC_SAR_RANGE_INTR_MASK_REG = config->rangeIntMask;
    ADC_SAR_INTR_MASK_REG = ADC_EOS_MASK;

    for(chNum = 0u; chNum < config->numChannels; chNum++)
    {
        tmpRegVal = (ADC_channelsConfig[config->channelBase + chNum]
        & ADC_CHANNEL_CONFIG_MASK);

        #if(ADC_TOTAL_CHANNELS_NUM > 1)
            tmpRegVal |= ADC_InputsPlacement[config->channelBase + chNum];
            /*Non-paired differential channels set NEG_ADDR_EN and clear DIFFERENTIAL_EN */
            if(0u != (ADC_InputsPlacement[config->channelBase + chNum] & ADC_CHANNEL_CONFIG_NEG_ADDR_EN_MSK))
            {
                tmpRegVal &= ~ADC_SAR_CHAN_CONFIG_DIFFERENTIAL_EN_MSK;
            }
        #endif

