gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC.c
        CY_SET_REG32((reg32 *)(ADC_SAR_CHAN_CONFIG_IND + (uint32)(chNum << 2)), tmpRegVal);
    }

    return;
}

/* ****************************************************************************
* Function Name: ADC_SetDFTControl
****************************************************************************//*
*
* \brief Internal function to configure the DFT_CTRL register.
* This register is a non-retention register therefore it resets
* when the SAR block is powered down.
* The register must be configured every time the SAR block is enabled.
*
* \param
* config: Pointer to the configuration structure
*
*******************************************************************************/
static void ADC_SetDFTControl(const ADC_CONFIG_STRUCT *config)
{
    /* Double the non-overlap delay and latch enable time when using */
    /* internal reference without bypass cap */
    uint32 tmpRegVal = ADC_SAR_DFT_CTRL_REG;
    if(((config->ctrl & ADC__SAR_CTRL_VREF_BYP_AND_SEL_MSK)
        == ADC__INTERNAL1024)
        || ((config->ctrl & ADC__SAR_CTRL_VREF_BYP_AND_SEL_MSK)
        == ADC__INTERNALVREF))
    {
        tmpRegVal &= ~ADC_SAR_DFT_CTRL_DCEN_MSK;
        tmpRegVal |= ADC_SAR_DFT_CTRL_DLY_INC_MSK;
    }
    else
    {
        tmpRegVal |= ADC_SAR_DFT_CTRL_DCEN_MSK;
        tmpRegVal &= (uint32)~ADC_SAR_DFT_CTRL_DLY_INC_MSK;
    }
    ADC_SAR_DFT_CTRL_REG = tmpRegVal;
}

/* ****************************************************************************
* Function Name: ADC_SelectConfig
****************************************************************************//*
*
* \brief Selects the predefined configuration for scanning. Disables
* and re-enables the SAR and filter (if filter used).
*
* \param config Number of configuration  in the ADC.
*
* \param restart Set to 1u to restart the ADC after
* selecting the configuration.
*
*******************************************************************************/
void ADC_SelectConfig(uint32 config, uint32 restart)
{
    /* Check whether the configuration number is valid or not */
    if(ADC_TOTAL_CONFIGS > config)
    {
        /* Stop the ADC before changing configurations */
        ADC_Stop();
        ADC_selected = 1u;

        if(0u == ADC_initVar)
        {
            ADC_Init();
            ADC_initVar |= ADC_INIT_VAR_INIT_FLAG;
        }
        #if (ADC_VREF_ROUTED)
            ADC_vrefAMux_DisconnectAll();
        #endif
        ADC_InitConfig(&ADC_allConfigs[config]);
        #if (ADC_VREF_ROUTED)
            ADC_vrefAMux_Select((uint8)config);
        #endif
        #if(0u != ADC_ANY_CONFIG_USES_FILTER)
            ADC_filterVinMux_Select((uint8)config);
            ADC_filterInit(config);
        #endif
        ADC_SAR_CHAN_EN_REG = ADC_allConfigs[config].chanEn;
        ADC_SAR_RANGE_INTR_MASK_REG = ADC_allConfigs[config].rangeIntMask;
        ADC_SAR_SATURATE_INTR_MASK_REG = ADC_allConfigs[config].satIntMask;
        ADC_currentConfig = config;

        if(1u == restart)
        {
            /* Restart the ADC */
            ADC_Start();

            /* Restart the scan */
            ADC_StartConvert();
        }
    }
    return;
}

/*******************************************************************************
* Function Name: ADC_StartConvert
****************************************************************************//**
*
* \brief In continuous mode, this API starts the conversion process and it runs
* continuously.

* In Single Shot mode, the function triggers a single scan and
* every scan requires a call of this function. The mode is set with the
* Sample Mode parameter in the customizer. The customizer setting can be
* overridden at run time with the ADC_SetConvertMode() function.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_StartConvert(void)
{
    /* Freerunning mode */
    if((ADC_SAR_SAMPLE_CTRL_REG
        & ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
        == ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    {
        ADC_SAR_SAMPLE_CTRL_REG |= ADC_SAR_SAMPLE_CTRL_CONTINUOUS_MSK ;
    }
    else /* Firmware trigger */
    {
        ADC_SAR_START_CTRL_REG = ADC_SAR_START_CTRL_FW_TRIGGER_MSK;
    }

    return;
}

/*******************************************************************************
* Function Name: ADC_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_StopConvert(void)
{
    if((ADC_SAR_SAMPLE_CTRL_REG
        & ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
        == ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK)
    {
        ADC_SAR_SAMPLE_CTRL_REG &= ~ADC_SAR_SAMPLE_CTRL_CONTINUOUS_MSK;

        if((ADC_allConfigs[ADC_currentConfig].miscConfig
            & ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
            == ADC_MISC_CONFIG_FILTER_PRESENT_MSK)
        {
            /* Re-synchronize the Filter if a filter is present */
            ADC_Stop();
            ADC_Start();
        }
    }

    return;
}
/*******************************************************************************
* Function Name: ADC_SetConvertMode
****************************************************************************//**
*
* \brief Sets the conversion mode to either Single-Shot or continuous. This
* function overrides the settings applied in the customizer. Changing
* configurations will restore the values set in the customizer.
*
* \param mode Sets the conversion mode. See table below for details.
* | Options                          | Description                             |
* | :------------------------------- | :-------------------------------------- |
* | ADC_SINGLE_SHOT     | Calling the ADC_StartConvert() function after setting mode this will trigger a single scan. Sets the SOC signal to be edge sensitive, each edge will trigger a single scan. |
* | ADC_CONTINUOUS      | Calling the ADC_StartConvert() function after setting this mode trigger continuous scanning. This mode sets the SOC signal to be level sensitive. The ADC will continuously scan while soc is active. |
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetConvertMode(uint32 mode)
{
    if(ADC_CONTINUOUS == mode)
    {
        ADC_SAR_SAMPLE_CTRL_REG |= ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK;
    }
    else
    {
        ADC_SAR_SAMPLE_CTRL_REG &= ~ADC_SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_MSK;
    }
}
/* ****************************************************************************
* Function Name: ADC_IRQ_Enable
****************************************************************************//*
*
* \brief Enables interrupts to occur at the end of a conversion. Global
* interrupts must also be enabled for the ADC interrupts to occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/


