gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC.c
/* ****************************************************************************
* Function Name: ADC_IRQ_Disable
****************************************************************************//*
*
* \brief Disables end of conversion interrupts.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/


/*******************************************************************************
* Function Name: ADC_SetEosMask
****************************************************************************//**
*
* \brief Sets of clears the End of Scan (EOS) interrupt mask.
*
* \param mask 1 to set the mask, 0 to clear the mask.
*
* \return None
*
* \sideeffect All other bits in the INTR register are cleared by this function.
*
*******************************************************************************/
void ADC_SetEosMask(uint32 mask)
{
    ADC_SAR_INTR_MASK_REG = mask & ADC_EOS_MASK;

    return;
}

/* ****************************************************************************
* Function Name: ADC_SetChanMask
****************************************************************************//*
*
* \brief Sets enable/disable mask for all channels in current configuration.
*
*
* \param enableMask
*  Channel enable/disable mask.
*
* \sideeffect
*  None.
*
*******************************************************************************/
void ADC_SetChanMask(uint32 enableMask)
{
    uint32 chanCount = ADC_allConfigs[ADC_currentConfig].numChannels;
    enableMask &= (uint32)((uint32)(1ul << chanCount) - 1ul);
    ADC_SAR_CHAN_EN_REG = enableMask;
    return;
}

/*******************************************************************************
* Function Name: ADC_IsEndConversion
****************************************************************************//**
*
* \brief Immediately returns the status of the conversion or does not return
* (blocking) until the conversion completes, depending on the retMode parameter.
*
* \param retMode Check conversion return mode. See the following table for
* options.
* | Options                              | Description                             |
* | :-------------------------------     | :-------------------------------------- |
* | ADC_RETURN_STATUS       | Immediately returns the conversion status for sequential channels. If the value returned is zero, the conversion is not complete, and this function should be retried until a nonzero result is returned. |
* | ADC_WAIT_FOR_RESULT     | Does not return a result until the ADC conversion of all sequential channels is complete. |
*
* \return uint8: If a nonzero value is returned, the last conversion is complete.
* If the returned value is zero, the ADC is still calculating the last result.
*
* \sideeffect This function reads the end of conversion status, and clears it afterward.
*
*******************************************************************************/
uint32 ADC_IsEndConversion(uint32 retMode)
{
    uint32 endOfConversion = 0u;
    uint32 wdt = 0x3FFFFFFuL; /* Watchdog timer for blocking while loop */
    if((ADC_RETURN_STATUS == retMode) || (ADC_WAIT_FOR_RESULT == retMode))
    {
        do
        {
            endOfConversion = ADC_SAR_INTR_REG & ADC_EOS_MASK;
            wdt--;
        }while(((0u == endOfConversion)
            && (((uint32) retMode & ADC_WAIT_FOR_RESULT) != 0u))
            && (0uL != wdt));

        if(0u != endOfConversion)
        {
            /* Clear EOS bit */
            ADC_SAR_INTR_REG = ADC_EOS_MASK;
        }
    }

    return endOfConversion;
}

/* ****************************************************************************
* Function Name: ADC_IsChannelSigned(uint32 chan)
****************************************************************************//*
*
* Determines if the provided channel is in signed format.
*
* \param chan The ADC channel to check.
*
* \return None
*
* \sideeffect None
*
*
*******************************************************************************/
static int32 ADC_IsChannelSigned(uint32 chan)
{
    int32 isSigned = 0;
    uint32 chanConfig;

    chanConfig = CY_GET_REG32((reg32 *)(ADC_SAR_CHAN_CONFIG_IND + (uint32)(chan << 2u)));
    /* If differential mode */
    if(0u != (chanConfig & ADC_CHANNEL_CONFIG_DIFF_ALL_MSK))
    {
        /*If signed differential */
        if((ADC_allConfigs[ADC_currentConfig].sampleCtrl
            & ADC_SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_MSK) != 0u)
        {
            isSigned = 1;
        }
    }
    else
    {
        if((ADC_allConfigs[ADC_currentConfig].sampleCtrl
            & ADC_SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_MSK) != 0u)
        {
            isSigned = 1;
        }
    }
    return isSigned;
}
/*******************************************************************************
* Function Name: ADC_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC channel to read the result from. The first
* channel is 0 and the injection channel if enabled is the number of valid
* channels.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
int16 ADC_GetResult16(uint32 chan)
{
    uint32 adcResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    if(ADC_allConfigs[ADC_currentConfig].numChannels > chan)
    {
        adcResult = CY_GET_REG32((reg32 *)(ADC_SAR_CHAN_RESULT_IND + (uint32)(chan << 2u))) &
            ADC_RESULT_MASK;
    }
    else
    {
        adcResult = 0u;
    }

    return (int16) adcResult;
}

/*******************************************************************************
* Function Name: ADC_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC channel to read the result from. The first
* channel is 0 and the injection channel if enabled is the number of valid
* channels.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
int32 ADC_GetResult32(uint32 chan)
{
    uint32 adcResult;
    int16 adcResult16;
    int32 finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    if(ADC_allConfigs[ADC_currentConfig].numChannels > chan)
    {
        adcResult = CY_GET_REG32((reg32 *)(ADC_SAR_CHAN_RESULT_IND + (uint32)(chan << 2u))) &
            ADC_RESULT_MASK;
    }
    else
    {
        adcResult = 0u;
    }
    /* Sign extend if channel is signed format */
    if(ADC_IsChannelSigned(chan) == 1)
    {
        adcResult16 = (int16) adcResult;
        finalResult = (int32) adcResult16;
    }
    else
    {
        finalResult = (int32) adcResult;
    }
    return finalResult;
}

