gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC.c
/*******************************************************************************
* Function Name: ADC_SetLowLimit
****************************************************************************//**
*
* \brief Sets the low limit parameter for a limit condition.
*
* \param lowLimit The low limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetLowLimit(uint32 lowLimit)
{
    ADC_SAR_RANGE_THRES_REG &= ~(uint32)(ADC_SAR_RANGE_THRES_RANGE_LOW_MSK);
    ADC_SAR_RANGE_THRES_REG |= lowLimit & ADC_SAR_RANGE_THRES_RANGE_LOW_MSK;
    return;
}

/*******************************************************************************
* Function Name: ADC_SetHighLimit
****************************************************************************//**
*
* \brief Sets the high limit parameter for a limit condition.
*
* \param highLimit The high limit for a limit condition.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetHighLimit(uint32 highLimit)
{
    ADC_SAR_RANGE_THRES_REG &= ~(uint32)(ADC_SAR_RANGE_THRES_RANGE_HIGH_MSK);
    ADC_SAR_RANGE_THRES_REG |= (uint32)(highLimit << ADC_SAR_RANGE_THRES_RANGE_HIGH_SHFT);
    return;
}

/*******************************************************************************
* Function Name: ADC_SetLimitMask
****************************************************************************//**
*
* \brief Sets the channel limit condition mask.
*
* \param limitMask Sets which channels that may cause a limit condition interrupt.
* Setting bits for channels that do not exist will have no effect. For example,
* if only 6  channels were enabled, setting a mask of 0x0103 would only enable
* the last two channels (0 and 1).
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetLimitMask(uint32 limitMask)
{
    uint32 chanCount = ADC_allConfigs[ADC_currentConfig].numChannels;
    limitMask &= (uint32)((uint32)(1ul << chanCount) - 1ul);
    ADC_SAR_RANGE_INTR_MASK_REG = limitMask;
    return;
}

/*******************************************************************************
* Function Name: ADC_SetSatMask
****************************************************************************//**
*
* \brief Sets the channel saturation event mask.
*
* \param satMask Sets which channels that may cause a saturation event interrupt.
* Setting bits for channels that do not exist will have no effect. For example,
* if only 8 channels were enabled, setting a mask of 0x01C0 would only enable two
* channels (6 and 7).
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetSatMask(uint32 satMask)
{
    uint32 chanCount = ADC_allConfigs[ADC_currentConfig].numChannels;
    satMask &= (uint32)((uint32)(1ul << chanCount) - 1ul);
    ADC_SAR_SATURATE_INTR_MASK_REG = satMask;
    return;
}

/*******************************************************************************
* Function Name: ADC_SetOffset
****************************************************************************//**
*
* \brief Sets the ADC offset that is used by the functions ADC_CountsTo_uVolts,
* ADC_CountsTo_mVolts, and ADC_CountsTo_Volts.
*
* Offset is applied to counts before unit scaling and gain.  All CountsTo_[mV, uV, V]olts()
* functions use the following equation:
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* See CountsTo_Volts() for more about this formula.
*
* To set channel 0's offset based on known V_offset_mV, use:
*     ADC_SetOffset(0uL, -1 * V_offset_mV * (1uL << (Resolution - 1)) / V_ref_mV);
*
* \param chan ADC channel number.
*
* \param offset This value is a measured value when the inputs are shorted or
* connected to the same input voltage.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetOffset(uint32 chan, int16 offset)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    ADC_offset[ADC_allConfigs[ADC_currentConfig].channelBase + chan] = offset;
    return;
}

/*******************************************************************************
* Function Name: ADC_SetGain
****************************************************************************//**
*
* \brief Sets the ADC gain in counts per 10 volt for the voltage
* conversion functions. This value is set by default by the reference and
* input range settings. Gain is applied after offset and unit scaling.  All
* CountsTo_[mV, uV, V]olts() functions use the following equation:
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* See CountsTo_Volts() for more about this formula.
*
* To set channel 0's gain based on known V_ref_mV, use:
*     ADC_SetGain(0uL, 10000 * (1uL << (Resolution - 1)) / V_ref_mV);
*
* \param chan ADC channel number.
*
* \param adcGain ADC gain in counts per 10 volt.
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
void ADC_SetGain(uint32 chan, int32 adcGain)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    ADC_countsPer10Volt[ADC_allConfigs[ADC_currentConfig].channelBase + chan]
    = adcGain;
    return;
}
/*******************************************************************************
* Function Name: ADC_RawCounts2Counts
****************************************************************************//**
*
* \brief Converts the output of the SAR to an idealized count value.
*
* Divides by averaging amount, if needed, and subtracts offset.
*
* \param chan ADC channel number.
*
* \param adcCounts Result from the ADC conversion.
*
* \return Averaged and offset counts.
*
* \sideeffect None
*******************************************************************************/
int16 ADC_RawCounts2Counts(uint32 chan, int16 adcCounts)
{
    uint32 temp;
    uint32 averageAdcSamplesDiv;
    uint32 rawChannel;
    rawChannel = ADC_allConfigs[ADC_currentConfig].channelBase + chan;

    /* Halt CPU in debug mode if channel is out of valid range */
    CYASSERT(chan < ADC_allConfigs[ADC_currentConfig].numChannels);

    /* Divide the adcCount when accumulate averaging mode selected */
    /* If Average mode != fixed */
    if((ADC_allConfigs[ADC_currentConfig].sampleCtrl
        & ADC_SAR_SAMPLE_CTRL_AVG_SHIFT_MSK)
        != ADC_SAR_SAMPLE_CTRL_AVG_SHIFT_MSK)
    {
        /* If Channel uses averaging */
        if((ADC_channelsConfig[rawChannel] & ADC_SAR_CHAN_CONFIG_AVG_EN_MSK) != 0u)
        {
            /* Divide by 2^(AVG_CNT + 1) */
            averageAdcSamplesDiv = ((ADC_allConfigs[ADC_currentConfig].sampleCtrl
                & ADC_SAR_SAMPLE_CTRL_AVG_CNT_MSK)
                >> ADC_SAR_SAMPLE_CTRL_AVG_CNT_SHFT);
            averageAdcSamplesDiv = (1uL << (averageAdcSamplesDiv + 1uL));
                        /* When it's "Sequential, Sum", divider limit is 16 */
            /* If Mode is ACCUNDUMP */
            if((ADC_allConfigs[ADC_currentConfig].sampleCtrl
                & ADC_SAR_SAMPLE_CTRL_AVG_MODE_MSK)
                != ADC_SAR_SAMPLE_CTRL_AVG_MODE_MSK)
            {
                if (averageAdcSamplesDiv > 16uL)
                {
                    averageAdcSamplesDiv = 16uL;
                }
            }
            /* If unsigned format, prevent sign extension */
            if(0 == ADC_IsChannelSigned(chan))
            {
                temp = ((uint16) adcCounts / averageAdcSamplesDiv);
                adcCounts = (int16) temp;
            }
            else
            {
                adcCounts /= (int16) averageAdcSamplesDiv;
            }
        }
    }
    /* Subtract ADC offset */
    adcCounts -= ADC_offset[rawChannel];
    return adcCounts;
}

