gcristini/SkorpioTemperatureTest/PSOC-Firmware/SerialTemperatureSensor.cydsn/Generated_Source/PSoC4/ADC.c
        ADC_SetupComparatorTrim();

        /* Sweep from center to crossing */
        compStatus = ADC_SetOpampAndAgndTrim(ADC_OPAMP_TRIM_POS_BASE, ADC_AGND_TRIM_POS_BASE);
        if (0uL == compStatus)
        {
            opampTrim = ADC_RaiseOpampTrimToCrossing(ADC_OPAMP_TRIM_POS_BASE);
            agndTrim = ADC_RaiseAgndTrimToCrossing(ADC_AGND_TRIM_POS_BASE);
            if ((agndTrim == (ADC_AGND_TRIM_POS_LIMIT - 1uL))
                && (opampTrim != (ADC_OPAMP_TRIM_POS_LIMIT - 1uL)))
            {
                opampTrim = ADC_IncOpampTrim(opampTrim);
                (void) ADC_SetOpampAndAgndTrim(opampTrim, ADC_AGND_TRIM_POS_BASE);
                (void) ADC_LowerAgndTrimToCrossing(ADC_AGND_TRIM_POS_BASE);
            }
        }
        else
        {
            opampTrim = ADC_LowerOpampTrimToCrossing(ADC_OPAMP_TRIM_POS_BASE);
            agndTrim = ADC_LowerAgndTrimToCrossing(ADC_AGND_TRIM_POS_BASE);
            if ((agndTrim == (ADC_AGND_TRIM_NEG_LIMIT - 1uL))
                && (opampTrim != (ADC_OPAMP_TRIM_NEG_LIMIT - 1uL)))
            {
                opampTrim = ADC_DecOpampTrim(opampTrim);
                (void) ADC_SetOpampAndAgndTrim(opampTrim, ADC_AGND_TRIM_POS_BASE);
                (void) ADC_RaiseAgndTrimToCrossing(ADC_AGND_TRIM_POS_BASE);
            }
        }

        ADC_UndoComparatorTrimSetup();
    }

    /*******************************************************************************
    * Function Name: ADC_SetupComparatorTrim
    ********************************************************************************
    *
    * Make proper connections to being trimming the Agnd buffer
    * and Opamp offset.
    *
    *******************************************************************************/
    static void ADC_SetupComparatorTrim(void)
    {
        ADC_filterVinMux_Select(ADC_FILTER_AMUX_CHANNEL);
    }

    /*******************************************************************************
    * Function Name: ADC_UndoComparatorTrimSetup
    ********************************************************************************
    *
    * Undo all changes made in ADC_SetupComparatorTrim()
    * to bring the Component back to normal operation.
    *
    *******************************************************************************/
    static void ADC_UndoComparatorTrimSetup(void)
    {
        ADC_filterVinMux_Select((uint8)ADC_currentConfig);
    }

    /*******************************************************************************
    * Function Name: ADC_RaiseOpampTrimToCrossing
    ********************************************************************************
    *
    * Step through the Opamp trim codes in increasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_RaiseOpampTrimToCrossing(uint32 startTrim)
    {
        uint32 opampTrim;
        uint32 lastOpampTrim;
        uint32 compStatus;

        lastOpampTrim = startTrim;
        for (opampTrim = startTrim;
            opampTrim != ADC_OPAMP_TRIM_NEG_LIMIT;
            opampTrim = ADC_IncOpampTrim(opampTrim))
        {
            compStatus = ADC_SetOpampAndAgndTrim(opampTrim, ADC_AGND_TRIM_POS_BASE);
            if (0uL != compStatus)
            {
                (void) ADC_SetOpampTrim(lastOpampTrim);
                break;
            }
            lastOpampTrim = opampTrim;
        }

        return lastOpampTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_LowerOpampTrimToCrossing
    ********************************************************************************
    *
    * Step through the Opamp trim codes in decreasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_LowerOpampTrimToCrossing(uint32 startTrim)
    {
        uint32 opampTrim;
        uint32 lastOpampTrim;
        uint32 compStatus;

        lastOpampTrim = startTrim;
        for (opampTrim = startTrim;
            opampTrim != ADC_OPAMP_TRIM_NEG_LIMIT;
            opampTrim = ADC_DecOpampTrim(opampTrim))
        {
            compStatus = ADC_SetOpampAndAgndTrim(opampTrim, ADC_AGND_TRIM_POS_BASE);
            if (0uL == compStatus)
            {
                (void) ADC_SetOpampTrim(lastOpampTrim);
                break;
            }
            lastOpampTrim = opampTrim;
        }

        return lastOpampTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_RaiseAgndTrimToCrossing
    ********************************************************************************
    *
    * Step through the Agnd trim codes in increasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_RaiseAgndTrimToCrossing(uint32 startTrim)
    {
        uint32 agndTrim;
        uint32 lastAgndTrim;
        uint32 compStatus;

        lastAgndTrim = startTrim;
        for (agndTrim = startTrim;
            agndTrim != ADC_AGND_TRIM_NEG_LIMIT;
            agndTrim = ADC_IncAgndTrim(agndTrim))
        {
            compStatus = ADC_SetAgndTrim(agndTrim);
            if (0uL != compStatus)
            {
                (void) ADC_SetAgndTrim(lastAgndTrim);
                break;
            }
            lastAgndTrim = agndTrim;
        }

        return lastAgndTrim;
    }

    /*******************************************************************************
    * Function Name: ADC_LowerAgndTrimToCrossing
    ********************************************************************************
    *
    * Step through the Agnd trim codes in decreasing order
    * to find the point where the offset crosses Agnd.
    *
    *******************************************************************************/
    static uint32 ADC_LowerAgndTrimToCrossing(uint32 startTrim)
    {
        uint32 agndTrim = startTrim;
        uint32 lastAgndTrim = agndTrim;
        uint32 compStatus = 1uL;

        lastAgndTrim = startTrim;
        for (agndTrim = startTrim;
            agndTrim != ADC_AGND_TRIM_NEG_LIMIT;
            agndTrim = ADC_DecAgndTrim(agndTrim))
        {
            compStatus = ADC_SetAgndTrim(agndTrim);
            if (0uL == compStatus)
            {
                (void) ADC_SetAgndTrim(lastAgndTrim);
                break;
            }
            lastAgndTrim = agndTrim;
        }

        return lastAgndTrim;
    }

